# BuiltInFailures.ElectricityFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElectricityFailures Class
BuiltInFailures Class Members See Also
---
Failures related to electrical system and circuits.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class ElectricityFailures
```

Visual Basic
---
```text
Public NotInheritable Class ElectricityFailures
```

Visual C++
---
```text
public ref class ElectricityFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..ElectricityFailures
# See Also
BuiltInFailures..::..ElectricityFailures Members
Autodesk.Revit.DB Namespace